In [12]:
import pandas as pd
df=pd.read_csv(r'C:/Users/AL MADINA COMPUTER/Desktop/Machine Learning/height.csv')
df.head()

    Name  Height
0   moan     5.2
1  maria     5.1
2  sakib     5.5
3    tao     4.9
4  virat     5.4

In [13]:
max_thresold=df['Height'].quantile(0.95)    #quantile give percentile value for max thresold

In [14]:
df[df['Height']>max_thresold]         #identifying value above max thresold

   Name  Height
8  john    15.5

In [17]:
min_thresold=df['Height'].quantile(0.05)     #quantile give percentile value for min thresold
min_thresold

5.03

In [16]:
df[df['Height']<min_thresold]        #identifying value above max thresold

  Name  Height
3  tao     4.9

In [20]:
df[(df['Height']<max_thresold) & (df['Height']>min_thresold)]

       Name  Height
0      moan     5.2
1     maria     5.1
2     sakib     5.5
4     virat     5.4
5   khushbu     6.2
6    dmitry     6.5
7    selena     7.1
9     imran     7.1
10     jose    14.5
11  deepika     6.1
12    yosep     5.6
13    binod     5.5

In [22]:
df = pd.read_csv("C:/Users/AL MADINA COMPUTER/Desktop/Machine Learning/Loan data.csv")
df.head()

   age  credit-rating  children         loan
0   19         27.900         0  16884.92400
1   18         42.130         1   1725.55230
2   28         33.000         3   4449.46200
3   33         22.705         0  21984.47061
4   32         28.880         0   3866.85520

In [23]:
#Explore samples that are above 99.90% percentile and below 1% percentile rank

min_thresold, max_thresold = df.loan.quantile([0.001, 0.999])
min_thresold, max_thresold

(1133.0008917, 61726.286311560616)

In [24]:
df[df.loan < min_thresold]

     age  credit-rating  children       loan
808   18          30.14         0  1131.5066
940   18          23.21         0  1121.8739

In [25]:
df[df.loan > max_thresold]

      age  credit-rating  children         loan
543    54          47.41         0  63770.42801
1300   45          30.36         0  62592.87309

In [26]:
df2 = df[(df.loan<max_thresold) & (df.loan>min_thresold)]
df2.shape

(1334, 4)

In [27]:
df2.describe()

               age  credit-rating     children          loan
count  1334.000000    1334.000000  1334.000000   1334.000000
mean     39.223388      30.663317     1.098201  13213.799332
std      14.040276       6.094139     1.205805  11963.687535
min      18.000000      15.960000     0.000000   1135.940700
25%      27.000000      26.296250     0.000000   4746.521225
50%      39.000000      30.400000     1.000000   9382.033000
75%      51.000000      34.700000     2.000000  16584.318157
max      64.000000      53.130000     5.000000  60021.398970